app/controllers/games_controller.rb

SELECT `games`.* FROM `games`
---
  def index
    @games = Game.all

INSERT INTO `games` (`user_id`, `game_name`, `gamestart_datetime`, `gameend_datetime`, `gameball`, `cost`, `referee`, `important_point`, `created_at`, `updated_at`) VALUES (1, 'アンダーワールド大戦', '2020-07-27 09:00:00', '2020-07-27 12:00:00', 4, 4000, '3', '特になし', '2020-07-27 14:54:49', '2020-07-27 14:54:49')
---
  def create
    @game = Game.new(game_params)
    if @game.save

SELECT  `games`.* FROM `games` WHERE `games`.`id` = 3 LIMIT 1
---
  def show
    @game = Game.find(params[:id])